app/views/users/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
                  <i class="fas fa-heart"></i>
                    <%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 6]]
---
            <i class="far fa-heart"></i>
            <%= book.favorites.count %>

SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
---
        <% end %>
              <td>コメント件数：<%= book.book_comments.count %></td>