app/views/books/index.html.erb


                        <i class="fas fa-heart"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

                      <%= link_to book_favorites_path(book.id), method: :post do %>
                        <i class="fas fa-heart"></i><%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]

              <% end %>
              <td>コメント件数：<%= book.book_comments.count %></td>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]